
# Списки:
# 1. Создайте два любых списка и свяжите их с переменными.

list_one = [1, 2, 'amd']
list_two = [2, 3, [23, 'f']]

# 2. Извлеките из первого списка второй элемент.

print(list_one[1])


# 3. Измените во втором списке последний элемент. Выведите список на экран.

list_two[-1]= 'abc'
print(list_two)


# 4. Соедините оба списка в один, присвоив результат новой переменной. Выведите
# получившийся список на экран.
union_list = list_one + list_two
print(union_list)

# 5. "Снимите" срез из соединенного списка так, чтобы туда попали некоторые части
# обоих первых списков. Срез свяжите с очередной новой переменной. Выведите
# значение этой переменной.

union_list_slise = list_one[1:2] + list_two[1:2]
print(union_list_slise)

# 6. Добавьте в список два новых элемента и снова выведите его.
adding_element = 'row', 123
list_one.extend(adding_element)
print(list_one)

# Задание 7. Даны списки. Нужно вернуть список, который состоит из элементов,
# общих для этих двух списков. -- !не использовать циклы
a = [2, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 4, 6, 7, 8, 9, 1, 11, 12, 13]
# Списки преобразовали в множества (убрав повторяющиеся значения),
# выполнили операцию пересечения множеств (&)
c = list(set(a) & set(b))
print(c)

# Задание 8. Есть список. Оставить в нем только уникальные значения.
# !не использовать циклы

f = [1, 2, 3, 4, 3, 2, 5, 1, 4, 6, 7, 1, 8, 2, 3]
f = set(f)
f = list(f)
print(f)
